[Building_village_hadess.A_hadess_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在此城镇建造新建筑的选项。\n每天提供 500 %ICON_GOLD 黄金。"

[Building_village_hadess.A_hadess_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[Building_village_hadess.A_hadess_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[Building_village_hadess.A_hadess_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[Building_village_hadess.A_Hadess_Fortifications_Level1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位，直至驻军上限"

[Building_village_hadess.A_hadess_Fortifications_Level2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[Building_village_hadess.A_hadess_Fortifications_Level3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[Building_village_hadess.A_hadess_DarkWatch H7TownTower]
mName="邪恶岗哨"
mDesc="在攻城战中为城镇提供2座防御塔。\n为防守方军队中的单位增加 +10 %ICON_ATTACK 和 +15 %ICON_DEFENSE。"

[Building_village_hadess.A_hadess_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在此城镇提供7个随机的1级法术。\n它们会授予所有满足条件的访问英雄。"

[Building_village_hadess.A_hadess_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在此城镇提供6个随机的2级法术。\n它们会授予所有满足条件的访问英雄。"

[Building_village_hadess.A_hadess_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在此城镇提供4个随机的3级法术。\n它们会授予所有满足条件的访问英雄。"

[Building_village_hadess.A_hadess_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在此城镇提供2个随机的4级法术。\n它们会授予所有满足条件的访问英雄。"

[Building_village_hadess.A_hadess_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="允许招募英雄，包括新的和战败的英雄。新英雄的选择在每周初更换。"

[Building_village_hadess.A_hadess_HallsOfTheUnseenHandcornue_pool H7TownDwelling]
mName="角魔深坑"
mDesc="核心生物住所。\n允许招募角魔，每周产量为20。"

[Building_village_hadess.A_Dungeon_HallsOfTheBlackHeartcornueeveil_pool H7TownDwelling]
mName="恶魔之门"
mDesc="核心生物住所升级。\n允许招募并将角魔升级为监工魔。\n(基础产量：20/周)"

[Building_village_hadess.A_hadess_AssassinsGuild H7TownGrowthEnhancer]
mName="恶魔洞穴"
mDesc="核心生物住所升级。\n每周角魔或监工魔产量+10。"

[Building_village_hadess.A_hadess_ShadowArena_chien_enfer_pool H7TownDwelling]
mName="欢愉之屋"
mDesc="核心生物住所。\n允许招募魅魔，每周产量为20。"

[Building_village_hadess.A_hadess_ShadowRing_chienenfer_eveil_pool H7TownDwelling]
mName="诱惑后宫"
mDesc="核心生物住所升级。\n允许招募并将魅魔升级为魅姬。\n(基础产量：20/周)"

[Building_village_hadess.A_hadess_ShootingRange_chien_bonus_growth H7TownGrowthEnhancer]
mName="青楼"
mDesc="核心生物住所升级。\n每周魅魔或魅姬产量+10。"

[Building_village_hadess.A_hadess_CradleOfStone_succub_pool H7TownDwelling]
mName="地狱犬舍"
mDesc="核心生物住所。\n允许招募地狱犬，每周产量为8。"

[Building_village_hadess.A_hadess_ChthonianAbyss_succube_eveil H7TownDwelling]
mName="地狱三头犬舍"
mDesc="核心生物住所升级。\n允许招募并将地狱犬升级为地狱三头犬。\n(基础产量：8/周)"

[Building_village_hadess.A_hadess_UnfathomableCaves_bonusgrowth_succube H7TownGrowthEnhancer]
mName="训练场"
mDesc="核心生物住所升级。\n每周地狱犬或地狱三头犬产量+6。"

[Building_village_hadess.A_hadess_LakeOfStilledVoices_efreet_pool H7TownDwelling]
mName="火怪神灯"
mDesc="精英生物住所。\n允许招募火精灵，每周产量为6。"

[Building_village_hadess.A_hadess_FrozenStatuary_efreet_eveil_pool H7TownDwelling]
mName="火怪苏丹神灯"
mDesc="精英生物住所升级。\n允许招募并将火精灵升级为火怪苏丹。\n(基础产量：6/周)"

[Building_village_hadess.A_hadess_SnakeTower_groyw_bonus_efreet H7TownGrowthEnhancer]
mName="未竟之梦洞穴"
mDesc="精英生物住所升级。\n每周火精灵/火怪苏丹或地狱蜘蛛/深渊狼蛛产量+5。"

[Building_village_hadess.A_hadess_StriderForge_juggernaute_pool H7TownDwelling]
mName="悍魔之门"
mDesc="精英生物住所。\n允许招募悍魔，每周产量为5。"

[Building_village_hadess.A_hadess_SoullessForge_ravageur_pool H7TownDwelling]
mName="蹂躏者之门"
mDesc="精英生物住所升级。\n允许招募并将悍魔升级为蹂躏者。\n(基础产量：5/周)"

[Building_village_hadess.A_hadess_ShadowsteelPool_juggernautegrowth_bonus H7TownGrowthEnhancer]
mName="深渊通道"
mDesc="精英生物住所升级。\n每周悍魔或蹂躏者产量+5。"

[Building_village_hadess.A_hadess_Maze_sabime_pool H7TownDwelling]
mName="深渊王座"
mDesc="精英生物住所。\n允许招募深渊领主，每周产量为2。"

[Building_village_hadess.A_hadess_Labyrinth_sabime_eveil_pool H7TownDwelling]
mName="深渊魔王王座"
mDesc="精英生物住所升级。\n允许招募并将深渊领主升级为深渊魔王。\n(基础产量：2/周)"

[Building_village_hadess.A_hadess_AltarOfBrokenChainssabime H7TownGrowthEnhancer]
mName="混沌宫殿"
mDesc="精英生物住所升级。\n每周深渊领主或深渊魔王产量+2。"

[Building_village_hadess.A_hadess_HissingTemple_magog_pool H7TownDwelling]
mName="混沌之子巢穴"
mDesc="冠军生物住所。\n允许招募混沌之子，每周产量为2。"

[Building_village_hadess.A_hadess_RattlingTemple_magog-eveil H7TownDwelling]
mName="玛各巢穴"
mDesc="冠军生物住所升级。\n允许招募并将混沌之子升级为玛各。\n(基础产量：2/周)"

[Building_village_hadess.A_hadess_DragonSpire_diable_pool H7TownDwelling]
mName="遗弃宫殿"
mDesc="冠军生物住所。\n允许招募恶魔，每周产量为2。"

[Building_village_hadess.A_hadess_DragonPinnacle_diable_eveil_pool H7TownDwelling]
mName="大恶魔王国"
mDesc="冠军生物住所升级。\n允许招募并将恶魔升级为大恶魔。\n(基础产量：2/周)"

[New_Build.A_hadess_chambre_nemesis H7TownDwelling]
mName="灰烬尖塔"
mDesc="冠军生物住所。\n允许招募无情猎人。\n可以使用“全部招募”功能招募\n(基础产量：1/周)"

[New_Build.A_hadess_chambre_nosferatu H7TownDwelling]
mName="罪孽之环"
mDesc="精英生物住所。\n允许招募诺斯费拉图。\n可以使用“全部招募”功能招募\n(基础产量：4/周)"

[Building_village_hadess.A_hadess_ChamberOfWhispers_warfarrecru H7TownUtilityUnitDwelling]
mName="混沌之室"
mDesc="进攻型战争单位生产。\n提供购买繁殖者的选项。"

[Building_village_hadess.A_hadess_warfare_Akuma H7TownUtilityUnitDwelling]
mName="阿库玛之环"
mDesc="支援型战争单位生产。\n提供购买阿库玛的选项。"

[Building_village_hadess.A_hadess_Moat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。"

[Building_village_hadess.A_hadess_HallOfIntrigue H7TownHallOfIntrigue]
mName="地狱马厩"
mDesc="访问英雄获得+5移动力，持续到本周末"

[Building_village_hadess.A_hadess_OverlookTower H7TownBuilding]
mName="瞭望塔"
mDesc="访问英雄在接下来的3场战斗中获得+10 %icon_initiative 主动性。"

[Building_village_hadess.A_hadess_Portail_infernal H7TownBuilding]
mName="地狱传送门"
mDesc="英雄获得邪恶灵魂技能，可在战斗中复活1次10%的战败单位。"

[Building_village_hadess.A_hadess_Black_Market H7BlackMarket]
mName="黑市"
mDesc="允许你购买和出售宝物。"

[Building_village_hadess.A_hadess_Marketplace H7TownMarketplace]
mName="市场"
mDesc="提供交易资源的选项。"

[Building_village_hadess.A_hadess_PillarOfEyes H7TownUtilityUnitDwelling]
mName="地狱熔炉"
mDesc="每天额外生产 500 %ICON_GOLD 黄金。"

[Building_village_hadess.A_hadess_SpiesGuild H7TownSpiesGuild]
mName="间谍行会"
mDesc="为盗贼行会提供派遣间谍执行“掠夺”任务的选项：掠夺目标玩家的随机资源点。"

[Building_village_hadess.A_hadess_ThievesGuild H7TownThiefGuild]
mName="盗贼行会"
mDesc="提供付费获取对手信息的选项。"

[Building_village_hadess.A_hadess_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="为所有访问此城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄可以返回此城镇，如果这是最近的可用城镇。"

[Building_village_hadess.A_hadessAltarOfSacrifice H7TownUnitConverter]
mName="扭曲之室"
mDesc="提供将活体生物转换为蹂躏者的选项。"

[Building_village_hadess.A_hadessShadowsteelRefinery H7TownBuilding]
mName="暗影洞穴"
mDesc="每天提供 1 %icon_Shadowsteel 影钢。"

[Building_village_hadess.A_Dhadess_ChthonianDeposit H7TownBuilding]
mName="硫磺风暴云"
mDesc="每天提供 2 %icon_Ore 矿石。"

[Building_village_hadess.A_hadess_fonderie H7TownSiloBuilding]
mName="诅咒宝库"
mDesc="每天随机提供 1 %icon_Crystal 龙血水晶, %icon_Dragonsteel 龙钢, %icon_Shadowsteel 影钢 或 %icon_Starsilver 星银。"

[Building_village_hadess.A_hadess_SoulvenomCrucible H7TownBuilding]
mName="燃烧地狱"
mDesc="在前3个战斗回合开始时，对每个敌方单位造成相当于其生命值2%的 %icon_fire 火焰伤害。"

[Building_village_hadess.A_hadess_MarkOfMalassa H7TownTearOfAsha]
mName="厄加什的永恒诅咒"
mDesc="每天提供 5000 %ICON_GOLD 黄金，并将此城镇的生物产量提高50%。\n间谍可以额外破坏和掠夺两个目标。"

[build_new_spell_town.A_hadess_burning_BuffCreature H7BaseBuff]
mName="燃烧地狱"
mTooltip="造成相当于生命值2%的 %icon_fire 火焰伤害。\n持续 %durnow 回合。"

[build_new_spell_town.A_hadess_burning_BuffHero H7BaseBuff]
mName="燃烧地狱"
mTooltip="在前3个战斗回合开始时，对每个敌方单位造成相当于其生命值2%的 %icon_fire 火焰伤害。"

[build_new_spell_town.A_hadess_esprit_malinBuffCreature H7BaseBuff]
mName="燃烧地狱"
mTooltip="对所有敌人造成最高相当于其生命值2%的火焰伤害。"

[build_new_spell_town.A_Esprit_Malin H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="邪恶灵魂"
mTooltip="友方单位在战斗中死亡后，将以原始数量的10%复活。每个单位只能复活一次。"

[build_new_spell_town.A_espritmalin_Buff H7BaseBuff]
mName="邪恶灵魂"
mTooltip="友方单位在战斗中死亡后，将以原始数量的10%复活。每个单位只能复活一次。"

[build_new_spell_town.A_hadess_burning_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[build_new_spell_town.A_hadess_esprit_malin_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="邪恶灵魂"
mTooltip="以10%的数量复活战败的单位。"

[build_new_spell_town.A_hadess_esprit_malin_BuffHero H7BaseBuff]
mName="邪恶灵魂"
mTooltip="以10%的数量复活战败的单位。"

[build_new_spell_town.A_hadess_MarkOfMalassa_PlayerBuff H7BaseBuff]
mName="厄加什的永恒诅咒"
mTooltip="生物招募成本降低10%。"

[build_new_spell_town.A_hadess_MarkOfMalassa_TownBuff H7BaseBuff]
mName="厄加什的永恒诅咒"
mTooltip=""

[build_new_spell_town.A_hadessMarkOfMalassa_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="厄加什的永恒诅咒"
mTooltip="间谍可以额外破坏和掠夺两个目标。"

[Build_town.A_hadess_TownLv1 H7Town]
mName=""

[Hero_nosferatu.A_cornu_servitude_Buff H7BaseBuff]
mName="永恒奴役"
mTooltip="将该生物队伍复活至80%的数量。"

[Hero_nosferatu.A_cornue_servitude H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="恶魔束缚"
mTooltip="每场战斗一次，此英雄允许角魔和监工魔在被完全摧毁后以80%的数量复活。"

[Siegebuild.H7hadessGateSegment H7CombatMapGate]
mObstacleName="城门"

[Siegebuild.H7hadessMoat H7CombatMapMoat]
mObstacleName="护城河"

[Siegebuild.H7hadessNoShootingTower H7CombatObstacleFracturedObject]
mObstacleName=""

[Siegebuild.H7hadessTowerLeft H7CombatMapTower]
mObstacleName="防御塔"

[Siegebuild.H7hadessTowerUnit H7TowerUnit]
mName="地狱防御塔"
mLore=""

[Siegebuild.H7hadessWallSegment H7CombatMapWall]
mObstacleName="城墙"

[Dwelling.A_hadessDwellingLv1 H7Dwelling]
mName=""

[Dwelling.A_hadessDwellingLv2 H7Dwelling]
mName=""

[Dwelling.A_hadessDwellingLv3_diable H7Dwelling]
mName=""

[Dwelling.A_hadessDwellingLv3_magog H7Dwelling]
mName=""

[Dwelling.A_hadessFortLv1 H7Fort]
mName=""

[Faction.H7Factionhadess H7Faction]
mFactionName="地狱"
mFactionFortName="地狱要塞"
mFactionArmyName="地狱军队"

[globale_name.A_hadess_Dwelling_Lv1_Name H7GlobalName]
mName="乌尔-德拉斯克"

[globale_name.A_hadess_Dwelling_Lv2_Name H7GlobalName]
mName="乌尔-内比尔齐亚斯"

[globale_name.A_hadess_Dwelling_Lv3_Name H7GlobalName]
mName="乌尔-拉格"

[globale_name.A_hadess_Dwelling_Lv3_Name_l7 H7GlobalName]
mName="乌尔-里奥克"

[globale_name.A_hadess_Fort_Lv1_Name H7GlobalName]
mName="乌尔-尚戈尔"

[globale_name.A_hadess_Town_Lv1_Name H7GlobalName]
mName="地狱据点"

[globale_name.H7hadessTownNames H7GenericTownNames]
mTownNames[0]="乌尔-阿尔泽沃斯"
mTownNames[1]="乌尔-查德罗斯"
mTownNames[2]="乌尔-埃斯塔罗斯"
mTownNames[3]="乌尔-吉赫纳"
mTownNames[4]="乌尔-戈索尔"
mTownNames[5]="乌尔-赫诺克"
mTownNames[6]="乌尔-伊辛"
mTownNames[7]="乌尔-卡格"
mTownNames[8]="乌尔-科什"
mTownNames[9]="乌尔-库尔甘"
mTownNames[10]="乌尔-曼戈尔"
mTownNames[11]="乌尔-梅法斯"
mTownNames[12]="乌尔-托斯"
mTownNames[13]="乌尔-维斯法尔"

[fort.H7hadessGateSegment H7CombatMapGate]
mObstacleName="城门"

7.5_v2 :

Updated warfare building

[Faction.A_Lore_FactionInferno H7GeneralLoreEntry]
mName="地狱"
mText="恶魔是由混沌之龙厄加什创造的，用以对抗并击败元素龙的后代。几个世纪以来，他们一直被囚禁在谢尔格，这是由先知萨-伊拉姆的牺牲在亚山炽热核心中创造的神秘监狱。恶魔已经进化到享受炎热，但他们无法逃离监狱的事实是无法容忍的。然而，仪式中的一个漏洞在血月蚀发生时削弱了监狱，允许恶魔军团获得片刻自由，他们通常利用这个机会蜂拥而出，蹂躏亚山。\n地狱的等级制度复杂但结构简单：最强者统治，将他们的意志强加于最弱者，所有恶魔都向六位恶魔霸主低下他们长角的头。一位新的领袖，卡-贝莱斯，开始宣扬恶魔组织的另一种可能性。他谈论一个所有恶魔生而平等，有权在谢尔格内外自由生活的世界。他正在聚集支持者，并打算利用下一次血月蚀在亚山站稳脚跟，揭露（即使不是强加）他的人民在龙神后代中享有平等地位的权利。"

______________________
v1.30

Added resource silo structure

v1.32

Updated 8th slot units

v1.36

Corrected Burning Hell structure and ability

v1.37

Corrected Tower descrpition to explain defender stat gains
Made many corrections and tweaks to make descriptions across castles be more consistent and correct
Changed alternate unit from T6 to T4, updated unit buildings accordingly